app/controllers/broadcasts_controller.rb

  def index
    @broadcasts = Broadcast.all
---
SELECT * FROM "broadcasts"