app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT * FROM "ideas"

  def show
    @idea = Idea.find(params[:id])
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)

  def new
    @idea = @current_user.ideas.create(params[:idea])
---
INSERT INTO "ideas" ("title", "author", "body", "created_at", "updated_at", "upvotes", "downvotes") VALUES(NULL, NULL, NULL, '2010-07-07 01:17:08', '2010-07-07 01:17:08', 1, 0)

  def edit
    @idea = Idea.find(params[:id])
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)

  def create
    @idea = @current_user.ideas.create(params[:idea])
---
INSERT INTO "ideas" ("title", "author", "date", "body", "created_at", "updated_at") VALUES('Test', 'Brian Stack', '2010-07-04', 'This is a test of the scaffold and rendering system!', '2010-07-04 07:13:02', '2010-07-04 07:13:02')

  def update
    @idea = Idea.find(params[:id])

    respond_to do |format|
      if @idea.update_attributes(params[:idea])
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 3)
UPDATE "ideas" SET "title" = 'This is gonna work!', "author" = 'I swear it', "body" = 'I think?', "updated_at" = '2010-07-07 01:17:21' WHERE "id" = 7

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 2)
DELETE FROM "ideas" WHERE "id" = 2