app/controllers/welcome_controller.rb

SELECT * FROM "ideas"
---
  def index
    @ideas = Idea.all